Revit 2027 API
FilterStringRuleEvaluator Class
 Base for all classes that compare string values from Revit to a user-supplied filter value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringRuleEvaluator : IDisposable
Public Class FilterStringRuleEvaluator
	Implements IDisposable
public ref class FilterStringRuleEvaluator : IDisposable
type FilterStringRuleEvaluator =
    class
        interface IDisposable
    end
The FilterStringRuleEvaluator type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilterStringRuleEvaluator
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringBeginsWith
 Autodesk.Revit.DB.FilterStringContains
 Autodesk.Revit.DB.FilterStringEndsWith
 Autodesk.Revit.DB.FilterStringEquals
 Autodesk.Revit.DB.FilterStringGreater
 Autodesk.Revit.DB.FilterStringGreaterOrEqual
 Autodesk.Revit.DB.FilterStringLess
 Autodesk.Revit.DB.FilterStringLessOrEqual